import { Component, signal } from '@angular/core';

@Component({
  imports: [],
  selector: 'app-race',
  styleUrl: './race.css',
  templateUrl: './race.html',
})
export class Race {
  Questions = signal<Question[]>([
    {
      QuestionBody:
        '    «مَا هِيَ رَأْسُ الْمَعْرِفَةِ كَمَا وَرَدَ فِي الإِصْحَاحِ الأَوَّلِ مِنْ سِفْرِ الأَمْثَالِ؟»',
      Choices: {
        A: 'أ) مَخَافَةُ الرَّبِّ',
        B: 'ب) كَثْرَةُ الْقِرَاءَةِ',
        C: 'ج) سَمَاعُ مَشُورَةِ الأَصْدِقَاءِ',
        D: 'د) حِفْظُ الأَسْرَارِ',
      },
      CorrectChoice: 'A',
      ref: ' «مَخَافَةُ الرَّبِّ رَأْسُ الْمَعْرِفَةِ، أَمَّا الْجَاهِلُونَ فَيَحْتَقِرُونَ الْحِكْمَةَ وَالأَدَبَ» (أم 1: 7)',
    },
    {
      QuestionBody: '«إِذَا أَرَاغَكَ الْخُطَاةُ فَمَاذَا تَفْعَلُ حَسَبَ نَصِيحَةِ الْحَكِيمِ؟»',
      Choices: {
        A: 'أ) تَمْشِي مَعَهُمْ لِتُرْشِدَهُمْ',
        B: 'ب) فَلاَ تَرْضَ وَامْنَعْ رِجْلَكَ عَنْ مَسَالِكِهِمْ',
        C: 'ج) تُجَادِلُهُمْ طَوِيلاً',
        D: 'د) تَسْكُتُ فَقَطْ',
      },
      CorrectChoice: 'B',
      ref: '«يَا ابْنِي، إِنْ أَرَاغَكَ الْخُطَاةُ فَلاَ تَرْضَ... اِمْنَعْ رِجْلَكَ عَنْ مَسَالِكِهِمْ» (أم 1: 10، 15)',
    },
    {
      QuestionBody:
        '«الْحِكْمَةُ تُنَادِي فِي الْخَارِجِ...» أَيْنَ تَرْفَعُ صَوْتَهَا كَمَا جَاءَ بِالنَّصِّ؟»',
      Choices: {
        A: 'أ) فِي الْقُصُورِ فَقَطْ',
        B: 'ب) فِي الأَسْوَاقِ وَعِنْدَ مَدَاخِلِ الأَبْوَابِ',
        C: 'ج) فِي الْبَرَارِي وَالْقِفَارِ',
        D: 'د) بَيْنَ الْعُلَمَاءِ سِرّاً',
      },
      CorrectChoice: 'B',
      ref: '«الْحِكْمَةُ تُنَادِي فِي الْخَارِجِ. فِي الشَّوَارِعِ تُعْطِي صَوْتَهَا. تَدْعُو فِي رُؤُوسِ الأَسْوَاقِ، فِي مَدَاخِلِ الأَبْوَابِ» (أم 1: 20-21',
    },
  ]);
  Racers = signal<Question[]>([
    {
      QuestionBody: '«إِذَا أَرَاغَكَ الْخُطَاةُ فَمَاذَا تَفْعَلُ حَسَبَ نَصِيحَةِ الْحَكِيمِ؟»',
      Choices: {
        A: 'أ) تَمْشِي مَعَهُمْ لِتُرْشِدَهُمْ',
        B: 'ب) فَلاَ تَرْضَ وَامْنَعْ رِجْلَكَ عَنْ مَسَالِكِهِمْ',
        C: 'ج) تُجَادِلُهُمْ طَوِيلاً',
        D: 'د) تَسْكُتُ فَقَطْ',
      },
      CorrectChoice: 'B',
      ref: '«يَا ابْنِي، إِنْ أَرَاغَكَ الْخُطَاةُ فَلاَ تَرْضَ... اِمْنَعْ رِجْلَكَ عَنْ مَسَالِكِهِمْ» (أم 1: 10، 15)',
    },
    {
      QuestionBody:
        '«الْحِكْمَةُ تُنَادِي فِي الْخَارِجِ...» أَيْنَ تَرْفَعُ صَوْتَهَا كَمَا جَاءَ بِالنَّصِّ؟»',
      Choices: {
        A: 'أ) فِي الْقُصُورِ فَقَطْ',
        B: 'ب) فِي الأَسْوَاقِ وَعِنْدَ مَدَاخِلِ الأَبْوَابِ',
        C: 'ج) فِي الْبَرَارِي وَالْقِفَارِ',
        D: 'د) بَيْنَ الْعُلَمَاءِ سِرّاً',
      },
      CorrectChoice: 'B',
      ref: '«الْحِكْمَةُ تُنَادِي فِي الْخَارِجِ. فِي الشَّوَارِعِ تُعْطِي صَوْتَهَا. تَدْعُو فِي رُؤُوسِ الأَسْوَاقِ، فِي مَدَاخِلِ الأَبْوَابِ» (أم 1: 20-21',
    },
  ]);
  objectEntries(obj: Choice) {
    return Object.entries(obj).map(([key, value]) => ({ key, value }));
  }
}
